results/mpi_benchmark/sysbench_fio/fio_cephfs-3nodes/bm_sys-fio_cephfs.worker06_1threads.1/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1063.20
    fsyncs/s:                     1366.06

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               16.61

General statistics:
    total time:                          10.0627s
    total number of events:              24320

Latency (ms):
         min:                                    0.00
         avg:                                    0.41
         max:                                    8.07
         95th percentile:                        1.55
         sum:                                 9988.03

Threads fairness:
    events (avg/stddev):           24320.0000/0.00
    execution time (avg/stddev):   9.9880/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1443.31
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  22.55
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0008s
    total number of events:              14436

Latency (ms):
         min:                                    0.00
         avg:                                    0.69
         max:                                    6.82
         95th percentile:                        1.08
         sum:                                 9948.75

Threads fairness:
    events (avg/stddev):           14436.0000/0.00
    execution time (avg/stddev):   9.9487/0.00